/**************************************************************УЧЕБА*************************************************************************************************/
/**************************************************************УЧЕБА*************************************************************************************************/
/**************************************************************УЧЕБА*************************************************************************************************/



/* console.log("Test"); */ 
/* проверка подключения к файлу js */

/* let name1 = "Никита"; 
переменная, должна работать с цифрами либо знаками доллар или воск */ 

let age = 25;

const name1 = "Никита"; 
/* не изменная переменная */

let boo = true; 
/* true - истина либо false - ложный */ /* ложь или истина */
/* пригождается когда нужно ставить проверку или условия */


/* правильное написание имени userName */

/* name1 = "Никита";
age = 25;  можно делать так или сразу через = вставлять значения в переменную*/

/* name1 = "nikita" 
можно перезаписать значения в переменную */ 

console.log(typeof name1, typeof age, typeof boo); 
/* typeof показывает тип данных (стока или цифры) string number boolean*/
/*  String (англ. string — «нить, вереница») — строковый тип данных в информатике. Значениями такого типа является произвольная последовательность (строка) символов алфавита.*/
/* number «число», «номер», «количество», «цифра», «сумма».*/
/* boolean (логический тип данных, булев тип, булевый тип) — примитивный тип данных в информатике.*/


/* console.log(name1,  age) */
/* выводит сразу две переменные */

const header = document.querySelector("#header"); /* можно выбрать через id нужно написать решетку # */
const header = document.querySelector("header"); /* выбор селектора из html */
const header = document.getElementById("header"); /* Выбор на прямую через id */

